IdeaRS.OpenModel.Detail.InclinedReinfBarType
Type of inclined bar

IdeaRS.OpenModel.Detail.InclinedReinfBarType.InputByLength
Length of bar is directly in put by user

IdeaRS.OpenModel.Detail.InclinedReinfBarType.FullLength
Length is extended to outer edges of structure